## Importing some major libraries and will start EDA part soon

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
df=pd.read_csv("Onion Prices 2020.csv")

In [3]:
df['min_price'].max()

18000

In [4]:
#trying to understand raw and columns
df.shape

(107295, 9)

In [5]:
df['variety'].max()

'White'

In [6]:
df.groupby('state')['state'].agg('count')

state
Andhra Pradesh         127
Chattisgarh            733
Goa                     74
Gujarat               2940
Haryana               6637
Himachal Pradesh      2486
Jammu and Kashmir      831
Jharkhand              302
Karnataka             3775
Kerala                8834
Madhya Pradesh        4333
Maharashtra           4788
NCT of Delhi           371
Nagaland                 7
Odisha                6938
Punjab               10783
Rajasthan             4974
Telangana              507
Tripura               1626
Uttar Pradesh        37263
Uttrakhand            1731
West Bengal           7235
Name: state, dtype: int64

In [7]:
df.groupby('district')['district'].agg('count')

district
Agra                1113
Ahmedabad             81
Ahmednagar           594
Ajmer                657
Alappuzha           1563
                    ...
Unokoti               32
Vadodara(Baroda)     243
Varanasi             190
Yamuna Nagar         739
kapurthala           150
Name: district, Length: 315, dtype: int64

In [8]:
df.groupby('variety')['variety'].agg('count')

variety
1st Sort             3490
2nd Sort               76
Bangalore-Samall        1
Beelary-Red           149
Bellary                 1
Big                  2989
Bombay (U.P.)         224
Dry F.A.Q.            191
Hybrid                 63
Local                3663
Medium                343
Nasik                3449
Onion               14712
Other               38316
Pole                  126
Puna                  348
Pusa-Red              436
Red                 36455
Small                1658
Telagi                115
White                 490
Name: variety, dtype: int64

In [9]:
df.groupby('commodity')['commodity'].agg('count')

commodity
Onion    107295
Name: commodity, dtype: int64

In [10]:
df.shape

(107295, 9)

In [11]:
#So that I can drop this Commodity. Because as we know that this whole data is about only ONION Commodity. So It is
# better to drop it and also same operation we can do for Arr. Date. Because these both features will not affect on our
#final ML Model. Droping useless features.!!

In [12]:
df1=df.drop(['commodity','state','district','arrival_date','variety'],axis='columns')
print(df.shape)
df1.head(2)

(107295, 9)

    market  min_price  max_price  modal_price
0  Kurnool       1350       4390       3100.0
1  Kurnool       1390       4400       3200.0

In [13]:
#So now it look like better.

In [14]:
Q1=df1.min_price.quantile(0.25)
Q3=df1.min_price.quantile(0.75)
print(Q1,Q3)
IQR=Q3-Q1
IQR

1000.0 2400.0

1400.0

In [15]:
lowerlimit=Q1-1.5*IQR
upperlimit=Q3+1.5*IQR
lowerlimit,upperlimit

(-1100.0, 4500.0)

In [16]:
df2=df1[~((df1.min_price<500) | (df1.min_price>4500))]
df2.describe()

          min_price     max_price   modal_price
count  96717.000000  96717.000000  96717.000000
mean    1705.002471   2068.449642   1898.737621
std      927.040323   1072.533093    978.043006
min      500.000000      0.000000    500.000000
25%     1000.000000   1230.000000   1150.000000
50%     1400.000000   1750.000000   1600.000000
75%     2200.000000   2600.000000   2425.000000
max     4500.000000  16000.000000   8000.000000

In [17]:
df2.shape

(96717, 4)

In [18]:
df3=df2.drop(['market'], axis='columns')
df3

        min_price  max_price  modal_price
0            1350       4390       3100.0
1            1390       4400       3200.0
2            1460       5150       4310.0
3            2010       5200       4200.0
4            1320       4050       3300.0
...           ...        ...          ...
107290       2200       2300       2250.0
107291       2050       2600       2200.0
107292       2700       2875       2800.0
107293       2625       2875       2800.0
107294       2800       2890       2870.0

[96717 rows x 3 columns]

In [19]:
marketdummies=pd.get_dummies(df2.market)
marketdummies.head()

,Abohar,Abu Road,Achalda,Achnera,Adampur,Agra,Ahmedabad(Chimanbhai Patal Market Vasana),Ahmednagar,Ajmer(F&V),Ajnala,...,Wansi,Washi(Thane Market),Wazirganj,Yamuna Nagar,Yawal,Yeola,Yusufpur,Zira,kalanwali,vadakarapathy
0,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [20]:
df4=pd.concat([df3,marketdummies], axis='columns')
df4.head()

,min_price,max_price,modal_price,Abohar,Abu Road,Achalda,Achnera,Adampur,Agra,Ahmedabad(Chimanbhai Patal Market Vasana),...,Wansi,Washi(Thane Market),Wazirganj,Yamuna Nagar,Yawal,Yeola,Yusufpur,Zira,kalanwali,vadakarapathy
0,1350,4390,3100.0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,1390,4400,3200.0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,1460,5150,4310.0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3,2010,5200,4200.0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,1320,4050,3300.0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [24]:
X=df4.drop(['modal_price'], axis='columns')
X.head()

,min_price,max_price,Abohar,Abu Road,Achalda,Achnera,Adampur,Agra,Ahmedabad(Chimanbhai Patal Market Vasana),Ahmednagar,...,Wansi,Washi(Thane Market),Wazirganj,Yamuna Nagar,Yawal,Yeola,Yusufpur,Zira,kalanwali,vadakarapathy
0,1350,4390,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,1390,4400,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,1460,5150,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3,2010,5200,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,1320,4050,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [26]:
y=df4.modal_price
y

0         3100.0
1         3200.0
2         4310.0
3         4200.0
4         3300.0
           ...
107290    2250.0
107291    2200.0
107292    2800.0
107293    2800.0
107294    2870.0
Name: modal_price, Length: 96717, dtype: float64

In [27]:
from sklearn.model_selection import train_test_split
X_train,X_test, y_train,y_test=train_test_split(X,y,test_size=0.2, random_state=10)

In [28]:
from sklearn.linear_model import LinearRegression
model=LinearRegression()
model.fit(X_train,y_train)
model.score(X_test,y_test)

-434826933792.89905

In [30]:
np.where(X.columns=='Ahmednagar')[0][0]

9

In [31]:
def predict_price(market,min_price,max_price):    
    loc_index = np.where(X.columns==market)[0][0]
    x = np.zeros(len(X.columns))
    x[0] = min_price
    x[1] = max_price
    if loc_index >= 0:
        x[loc_index] = 1

    return model.predict([x])[0]

In [34]:
predict_price('Ahmednagar',1200,7890)

5369.68641949445

In [35]:
import pickle

In [37]:
with open('farmersmodel.pickle','wb') as f:
    pickle.dump(model,f)

In [38]:
import json
columns = {
    'data_columns' : [col.lower() for col in X.columns]
}
with open("columns.json","w") as f:
    f.write(json.dumps(columns))